input/pagecontent/CheshireAndMerseysidePathology.md
```mermaid
sequenceDiagram


participant EPR as Order Placer
participant LIMSP as Order Filler (Pathology)
participant LIMSG as Order Filler (Genomics)


EPR ->> LIMSP: Submit Laboratory Order O21 (LAB-1)

LIMSP -->> LIMSP : Performs Test

opt Order Filler (Pathology) creates Genomic Order

    note over LIMSP,LIMSG: Same specimen can be reused for multiple tests

    LIMSP ->> LIMSG: Submit Genomic Reflex Order O21 (LAB-35)
    LIMSP -->> LIMSG: Send Specimen (not a technical interaction)
    LIMSG ->> LIMSP: Send Genomic Report R01 (LAB-36)
end

LIMSP ->> EPR: Send Laboratory Report R01 (LAB-3)
```
